INSERT INTO "Compensation_Discount" ("client_id", "booking_id", "description", "compensation_status", "date_issued") VALUES
(21, 69, 'Компенсация за неудобства с номером', 'Исполнено', '2024-12-26'),
(25, 73, 'Компенсация за позднее заселение', 'Исполнено', '2024-12-30'),
(28, 76, 'Компенсация за долгий процесс выселения', 'Исполнено', '2024-01-02'),
(23, 71, 'Компенсация за плохое качество еды', 'В процессе', '2024-12-29'),
(26, 74, 'Компенсация за неработающий кондиционер', 'В процессе', '2024-12-30'),
(29, 77, 'Компенсация за шум в отеле', 'В процессе', '2024-01-03'),
(31, 79, 'Компенсация за поврежденную мебель', 'Исполнено', '2024-01-05'),
(33, 81, 'Компенсация за позднюю уборку номера', 'Исполнено', '2024-01-07'),
(36, 84, 'Компенсация за ошибку в бронировании', 'В процессе', '2024-01-10'),
(37, 85, 'Компенсация за недостаточную уборку', 'Исполнено', '2024-01-11'),
(39, 87, 'Компенсация за неудобства во время проживания', 'В процессе', '2024-01-13'),
(43, 91, 'Компенсация за переплату', 'Исполнено', '2024-01-17'),
(45, 93, 'Компенсация за несоответствие описанию номера', 'В процессе', '2024-01-19');
