INSERT INTO "Hotel_Services" ("service_name", "service_description", "price") VALUES
('Парковка', 'Охраняемая парковка с круглосуточным доступом', 1000),
('СПА', 'Расслабляющие процедуры и массажи для отдыха', 3000),
('Фитнес-зал', 'Современный тренажерный зал с кардио- и силовым оборудованием', 2000),
('Бассейн', 'Закрытый подогреваемый бассейн с зоной отдыха', 3500),
('Сауна', 'Финская сауна для восстановления и релаксации', 2500),
('Доставка еды', 'Круглосуточная доставка блюд из ресторана', 2200),
('Коворкинг', 'Рабочая зона с доступом к высокоскоростному интернету', 300),
('Прокат велосипедов', 'Аренда велосипедов для прогулок по городу', 800);
